<!-- add-pr-comment:add-pr-comment -->

## Terraform CloudWatch Alarms plan
```
data.aws_cloudwatch_log_group.github_events_log_group: Reading...
module.unauthorized_users_modify_repository_settings_security.data.aws_cloudwatch_log_group.github_events_log_group: Reading...
module.unauthorized_users_modify_repository_settings_branch_protection.data.aws_cloudwatch_log_group.github_events_log_group: Reading...
module.unauthorized_users_modify_repository_settings_audit_log.data.aws_cloudwatch_log_group.github_events_log_group: Reading...
module.unauthorised_users_modify_repository_settings_mod_platform_alarm.aws_cloudwatch_metric_alarm.levgorbunov1_cancel_workflow_alarm: Refreshing state... [id=UnathorisedUsersModifyRepositorySettingsEventsModPlatformAlarm]
module.unauthorized_users_modify_repository_settings_visibility.data.aws_cloudwatch_log_group.github_events_log_group: Reading...
module.unauthorized_users_modify_repository_settings_repo_changes.data.aws_cloudwatch_log_group.github_events_log_group: Reading...
module.modernisation_platform_topic.aws_sns_topic.sns_topic: Refreshing state... [id=arn:aws:sns:eu-west-2:880656497252:modernisation-platform-github-alerts]
module.unauthorised_users_modify_repository_settings_mod_platform_alarm.aws_cloudwatch_log_metric_filter.levgorbunov1_cancel_workflow_filter: Refreshing state... [id=UnathorisedUsersModifyRepositorySettingsEventsModPlatform]
module.operations_engineering_topic.aws_sns_topic.sns_topic: Refreshing state... [id=arn:aws:sns:eu-west-2:880656497252:operations-engineering-github-alerts]
module.levgorbunov1_cancel_workflow_alarm.data.aws_cloudwatch_log_group.github_events_log_group: Reading...
module.unauthorized_users_modify_repository_settings_branch_protection.data.aws_cloudwatch_log_group.github_events_log_group: Read complete after 1s [id=/aws/lambda/GitHubIngestFunction]
module.unauthorized_users_modify_repository_settings_audit_log.data.aws_cloudwatch_log_group.github_events_log_group: Read complete after 1s [id=/aws/lambda/GitHubIngestFunction]
module.unauthorised_users_modify_repository_settings_alarm.data.aws_cloudwatch_log_group.github_events_log_group: Reading...
module.unauthorized_users_modify_repository_settings_admin_privileges.data.aws_cloudwatch_log_group.github_events_log_group: Reading...
module.unauthorized_users_modify_repository_settings_repo_changes.data.aws_cloudwatch_log_group.github_events_log_group: Read complete after 0s [id=/aws/lambda/GitHubIngestFunction]
module.unauthorized_users_modify_repository_settings_visibility.data.aws_cloudwatch_log_group.github_events_log_group: Read complete after 1s [id=/aws/lambda/GitHubIngestFunction]
data.aws_cloudwatch_log_group.github_events_log_group: Read complete after 1s [id=/aws/lambda/GitHubIngestFunction]
module.unauthorized_users_modify_repository_settings_security.data.aws_cloudwatch_log_group.github_events_log_group: Read complete after 1s [id=/aws/lambda/GitHubIngestFunction]
module.operations_engineering_topic.aws_sns_topic_subscription.email_subscription["lev.gorbunov@digital.justice.gov.uk"]: Refreshing state... [id=arn:aws:sns:eu-west-2:880656497252:operations-engineering-github-alerts:27741290-2203-45ed-8cd0-9982d078f215]
module.modernisation_platform_topic.aws_sns_topic_subscription.email_subscription["modernisation-platform@digital.justice.gov.uk"]: Refreshing state... [id=arn:aws:sns:eu-west-2:880656497252:modernisation-platform-github-alerts:71e5486e-76ed-4087-956f-aa5a8a1ad47f]
module.modernisation_platform_topic.aws_sns_topic_subscription.email_subscription["kudzai.mtoko@digital.justice.gov.uk"]: Refreshing state... [id=arn:aws:sns:eu-west-2:880656497252:modernisation-platform-github-alerts:8081d210-5220-4ade-a569-7987f14797ef]
module.levgorbunov1_cancel_workflow_alarm.data.aws_cloudwatch_log_group.github_events_log_group: Read complete after 0s [id=/aws/lambda/GitHubIngestFunction]
module.levgorbunov1_cancel_workflow_alarm.aws_cloudwatch_log_metric_filter.levgorbunov1_cancel_workflow_filter: Refreshing state... [id=Levgorbunov1CancelWorkflowEvents]
module.unauthorised_users_modify_repository_settings_alarm.data.aws_cloudwatch_log_group.github_events_log_group: Read complete after 0s [id=/aws/lambda/GitHubIngestFunction]
module.unauthorized_users_modify_repository_settings_admin_privileges.data.aws_cloudwatch_log_group.github_events_log_group: Read complete after 0s [id=/aws/lambda/GitHubIngestFunction]
module.unauthorised_users_modify_repository_settings_alarm.aws_cloudwatch_log_metric_filter.levgorbunov1_cancel_workflow_filter: Refreshing state... [id=UnathorisedUsersModifyRepositorySettingsEvents]
module.levgorbunov1_cancel_workflow_alarm.aws_cloudwatch_metric_alarm.levgorbunov1_cancel_workflow_alarm: Refreshing state... [id=Levgorbunov1CancelWorkflowEventsAlarm]
module.unauthorised_users_modify_repository_settings_alarm.aws_cloudwatch_metric_alarm.levgorbunov1_cancel_workflow_alarm: Refreshing state... [id=UnathorisedUsersModifyRepositorySettingsEventsAlarm]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  - destroy

Terraform will perform the following actions:

  # module.unauthorised_users_modify_repository_settings_mod_platform_alarm.aws_cloudwatch_log_metric_filter.levgorbunov1_cancel_workflow_filter will be destroyed
  # (because aws_cloudwatch_log_metric_filter.levgorbunov1_cancel_workflow_filter is not in configuration)
  - resource "aws_cloudwatch_log_metric_filter" "levgorbunov1_cancel_workflow_filter" {
      - id             = "UnathorisedUsersModifyRepositorySettingsEventsModPlatform" -> null
      - log_group_name = "/aws/lambda/GitHubIngestFunction" -> null
      - name           = "UnathorisedUsersModifyRepositorySettingsEventsModPlatform" -> null
      - pattern        = "{ ($.eventName = \"protected_branch.update_signature_requirement_enforcement_level\") && ($.userIdentity.details.Repository = \"ministryofjustice/modernisation-platform-terraform-ec2-instance\") }" -> null

      - metric_transformation {
          - dimensions = {} -> null
          - name       = "UnathorisedUsersModifyRepositorySettingsEventsModPlatform" -> null
          - namespace  = "GitHubMetrics" -> null
          - unit       = "None" -> null
          - value      = "1" -> null
        }
    }

  # module.unauthorised_users_modify_repository_settings_mod_platform_alarm.aws_cloudwatch_metric_alarm.levgorbunov1_cancel_workflow_alarm will be destroyed
  # (because aws_cloudwatch_metric_alarm.levgorbunov1_cancel_workflow_alarm is not in configuration)
  - resource "aws_cloudwatch_metric_alarm" "levgorbunov1_cancel_workflow_alarm" {
      - actions_enabled           = true -> null
      - alarm_actions             = [
          - "arn:aws:sns:eu-west-2:880656497252:modernisation-platform-github-alerts",
        ] -> null
      - alarm_description         = "Alarm for when any user modifies the settings of ministryofjustice/modernisation-platform repository" -> null
      - alarm_name                = "UnathorisedUsersModifyRepositorySettingsEventsModPlatformAlarm" -> null
      - arn                       = "arn:aws:cloudwatch:eu-west-2:880656497252:alarm:UnathorisedUsersModifyRepositorySettingsEventsModPlatformAlarm" -> null
      - comparison_operator       = "GreaterThanThreshold" -> null
      - datapoints_to_alarm       = 0 -> null
      - dimensions                = {} -> null
      - evaluation_periods        = 1 -> null
      - id                        = "UnathorisedUsersModifyRepositorySettingsEventsModPlatformAlarm" -> null
      - insufficient_data_actions = [] -> null
      - metric_name               = "UnathorisedUsersModifyRepositorySettingsEventsModPlatform" -> null
      - namespace                 = "GitHubMetrics" -> null
      - ok_actions                = [] -> null
      - period                    = 60 -> null
      - statistic                 = "Sum" -> null
      - tags                      = {} -> null
      - tags_all                  = {} -> null
      - threshold                 = 0 -> null
      - treat_missing_data        = "missing" -> null
    }

  # module.unauthorized_users_modify_repository_settings_admin_privileges.aws_cloudwatch_log_metric_filter.levgorbunov1_cancel_workflow_filter will be created
  + resource "aws_cloudwatch_log_metric_filter" "levgorbunov1_cancel_workflow_filter" {
      + id             = (known after apply)
      + log_group_name = "/aws/lambda/GitHubIngestFunction"
      + name           = "AdminPrivilegesChangeEvents"
      + pattern        = "{ ($.eventName = \"business.add_admin\" || $.eventName = \"business.remove_admin\" || $.eventName = \"business.audit_log_export\" || $.eventName = \"business.enable_two_factor_requirement\" || $.eventName = \"business.disable_two_factor_requirement\") && ($.userIdentity.details.Repository = \"ministryofjustice/modernisation-platform-terraform-ec2-instance\") }"

      + metric_transformation {
          + name      = "AdminPrivilegesChangeEvents"
          + namespace = "GitHubMetrics"
          + unit      = "None"
          + value     = "1"
        }
    }

  # module.unauthorized_users_modify_repository_settings_admin_privileges.aws_cloudwatch_metric_alarm.levgorbunov1_cancel_workflow_alarm will be created
  + resource "aws_cloudwatch_metric_alarm" "levgorbunov1_cancel_workflow_alarm" {
      + actions_enabled                       = true
      + alarm_actions                         = [
          + "arn:aws:sns:eu-west-2:880656497252:modernisation-platform-github-alerts",
        ]
      + alarm_description                     = "Alarm for administrative privilege changes in the repository"
      + alarm_name                            = "AdminPrivilegesChangeEventsAlarm"
      + arn                                   = (known after apply)
      + comparison_operator                   = "GreaterThanThreshold"
      + evaluate_low_sample_count_percentiles = (known after apply)
      + evaluation_periods                    = 1
      + id                                    = (known after apply)
      + metric_name                           = "AdminPrivilegesChangeEvents"
      + namespace                             = "GitHubMetrics"
      + period                                = 60
      + statistic                             = "Sum"
      + tags_all                              = (known after apply)
      + threshold                             = 0
      + treat_missing_data                    = "missing"
    }

  # module.unauthorized_users_modify_repository_settings_audit_log.aws_cloudwatch_log_metric_filter.levgorbunov1_cancel_workflow_filter will be created
  + resource "aws_cloudwatch_log_metric_filter" "levgorbunov1_cancel_workflow_filter" {
      + id             = (known after apply)
      + log_group_name = "/aws/lambda/GitHubIngestFunction"
      + name           = "AuditLogModificationEvents"
      + pattern        = "{ ($.eventName = \"audit_log_streaming.create\" || $.eventName = \"audit_log_streaming.destroy\") && ($.userIdentity.details.Repository = \"ministryofjustice/modernisation-platform-terraform-ec2-instance\") }"

      + metric_transformation {
          + name      = "AuditLogModificationEvents"
          + namespace = "GitHubMetrics"
          + unit      = "None"
          + value     = "1"
        }
    }

  # module.unauthorized_users_modify_repository_settings_audit_log.aws_cloudwatch_metric_alarm.levgorbunov1_cancel_workflow_alarm will be created
  + resource "aws_cloudwatch_metric_alarm" "levgorbunov1_cancel_workflow_alarm" {
      + actions_enabled                       = true
      + alarm_actions                         = [
          + "arn:aws:sns:eu-west-2:880656497252:modernisation-platform-github-alerts",
        ]
      + alarm_description                     = "Alarm for audit log modifications in the repository"
      + alarm_name                            = "AuditLogModificationEventsAlarm"
      + arn                                   = (known after apply)
      + comparison_operator                   = "GreaterThanThreshold"
      + evaluate_low_sample_count_percentiles = (known after apply)
      + evaluation_periods                    = 1
      + id                                    = (known after apply)
      + metric_name                           = "AuditLogModificationEvents"
      + namespace                             = "GitHubMetrics"
      + period                                = 60
      + statistic                             = "Sum"
      + tags_all                              = (known after apply)
      + threshold                             = 0
      + treat_missing_data                    = "missing"
    }

  # module.unauthorized_users_modify_repository_settings_branch_protection.aws_cloudwatch_log_metric_filter.levgorbunov1_cancel_workflow_filter will be created
  + resource "aws_cloudwatch_log_metric_filter" "levgorbunov1_cancel_workflow_filter" {
      + id             = (known after apply)
      + log_group_name = "/aws/lambda/GitHubIngestFunction"
      + name           = "BranchProtectionRuleModificationEvents"
      + pattern        = "{ ($.eventName = \"protected_branch.create\" || $.eventName = \"protected_branch.destroy\" || $.eventName = \"protected_branch.policy_override\" || $.eventName = \"protected_branch.update_admin_enforced\" || $.eventName = \"protected_branch.update_allow_force_pushes_enforcement_level\" || $.eventName = \"protected_branch.update_ignore_approvals_from_contributors\" || $.eventName = \"protected_branch.update_lock_allows_fetch_and_merge\" || $.eventName = \"protected_branch.update_pull_request_reviews_enforcement_level\" || $.eventName = \"protected_branch.update_require_code_owner_review\" || $.eventName = \"protected_branch.update_required_approving_review_count\" || $.eventName = \"protected_branch.update_required_status_checks_enforcement_level\" || $.eventName = \"protected_branch.update_signature_requirement_enforcement_level\") && ($.userIdentity.details.Repository = \"ministryofjustice/modernisation-platform-terraform-ec2-instance\") }"

      + metric_transformation {
          + name      = "BranchProtectionRuleModificationEvents"
          + namespace = "GitHubMetrics"
          + unit      = "None"
          + value     = "1"
        }
    }

  # module.unauthorized_users_modify_repository_settings_branch_protection.aws_cloudwatch_metric_alarm.levgorbunov1_cancel_workflow_alarm will be created
  + resource "aws_cloudwatch_metric_alarm" "levgorbunov1_cancel_workflow_alarm" {
      + actions_enabled                       = true
      + alarm_actions                         = [
          + "arn:aws:sns:eu-west-2:880656497252:modernisation-platform-github-alerts",
        ]
      + alarm_description                     = "Alarm for branch protection rule modifications in the repository"
      + alarm_name                            = "BranchProtectionRuleModificationEventsAlarm"
      + arn                                   = (known after apply)
      + comparison_operator                   = "GreaterThanThreshold"
      + evaluate_low_sample_count_percentiles = (known after apply)
      + evaluation_periods                    = 1
      + id                                    = (known after apply)
      + metric_name                           = "BranchProtectionRuleModificationEvents"
      + namespace                             = "GitHubMetrics"
      + period                                = 60
      + statistic                             = "Sum"
      + tags_all                              = (known after apply)
      + threshold                             = 0
      + treat_missing_data                    = "missing"
    }

  # module.unauthorized_users_modify_repository_settings_repo_changes.aws_cloudwatch_log_metric_filter.levgorbunov1_cancel_workflow_filter will be created
  + resource "aws_cloudwatch_log_metric_filter" "levgorbunov1_cancel_workflow_filter" {
      + id             = (known after apply)
      + log_group_name = "/aws/lambda/GitHubIngestFunction"
      + name           = "RepositorySettingsChangeEvents"
      + pattern        = "{ ($.eventName = \"repo.add_member\" || $.eventName = \"repo.change_merge_setting\" || $.eventName = \"repo.remove_member\" || $.eventName = \"repo.rename\" || $.eventName = \"repo.transfer\" || $.eventName = \"repo.transfer_start\" || $.eventName = \"repo.update_default_branch\") && ($.userIdentity.details.Repository = \"ministryofjustice/modernisation-platform-terraform-ec2-instance\") }"

      + metric_transformation {
          + name      = "RepositorySettingsChangeEvents"
          + namespace = "GitHubMetrics"
          + unit      = "None"
          + value     = "1"
        }
    }

  # module.unauthorized_users_modify_repository_settings_repo_changes.aws_cloudwatch_metric_alarm.levgorbunov1_cancel_workflow_alarm will be created
  + resource "aws_cloudwatch_metric_alarm" "levgorbunov1_cancel_workflow_alarm" {
      + actions_enabled                       = true
      + alarm_actions                         = [
          + "arn:aws:sns:eu-west-2:880656497252:modernisation-platform-github-alerts",
        ]
      + alarm_description                     = "Alarm for repository settings changes in the repository"
      + alarm_name                            = "RepositorySettingsChangeEventsAlarm"
      + arn                                   = (known after apply)
      + comparison_operator                   = "GreaterThanThreshold"
      + evaluate_low_sample_count_percentiles = (known after apply)
      + evaluation_periods                    = 1
      + id                                    = (known after apply)
      + metric_name                           = "RepositorySettingsChangeEvents"
      + namespace                             = "GitHubMetrics"
      + period                                = 60
      + statistic                             = "Sum"
      + tags_all                              = (known after apply)
      + threshold                             = 0
      + treat_missing_data                    = "missing"
    }

  # module.unauthorized_users_modify_repository_settings_security.aws_cloudwatch_log_metric_filter.levgorbunov1_cancel_workflow_filter will be created
  + resource "aws_cloudwatch_log_metric_filter" "levgorbunov1_cancel_workflow_filter" {
      + id             = (known after apply)
      + log_group_name = "/aws/lambda/GitHubIngestFunction"
      + name           = "SecurityScanningVulnerabilitiesChangeEvents"
      + pattern        = "{ ($.eventName = \"repository_security_configuration.removed\" || $.eventName = \"repository_vulnerability_alerts.disable\" || $.eventName = \"repository_vulnerability_alerts.enable\" || $.eventName = \"repository_secret_scanning.disable\" || $.eventName = \"repository_secret_scanning_push_protection.disable\" || $.eventName = \"dependabot_alerts.disable\" || $.eventName = \"dependabot_alerts.enable\" || $.eventName = \"secret_scanning.disable\" || $.eventName = \"secret_scanning.enable\") && ($.userIdentity.details.Repository = \"ministryofjustice/modernisation-platform-terraform-ec2-instance\") }"

      + metric_transformation {
          + name      = "SecurityScanningVulnerabilitiesChangeEvents"
          + namespace = "GitHubMetrics"
          + unit      = "None"
          + value     = "1"
        }
    }

  # module.unauthorized_users_modify_repository_settings_security.aws_cloudwatch_metric_alarm.levgorbunov1_cancel_workflow_alarm will be created
  + resource "aws_cloudwatch_metric_alarm" "levgorbunov1_cancel_workflow_alarm" {
      + actions_enabled                       = true
      + alarm_actions                         = [
          + "arn:aws:sns:eu-west-2:880656497252:modernisation-platform-github-alerts",
        ]
      + alarm_description                     = "Alarm for security scanning and vulnerabilities changes in the repository"
      + alarm_name                            = "SecurityScanningVulnerabilitiesChangeEventsAlarm"
      + arn                                   = (known after apply)
      + comparison_operator                   = "GreaterThanThreshold"
      + evaluate_low_sample_count_percentiles = (known after apply)
      + evaluation_periods                    = 1
      + id                                    = (known after apply)
      + metric_name                           = "SecurityScanningVulnerabilitiesChangeEvents"
      + namespace                             = "GitHubMetrics"
      + period                                = 60
      + statistic                             = "Sum"
      + tags_all                              = (known after apply)
      + threshold                             = 0
      + treat_missing_data                    = "missing"
    }

  # module.unauthorized_users_modify_repository_settings_visibility.aws_cloudwatch_log_metric_filter.levgorbunov1_cancel_workflow_filter will be created
  + resource "aws_cloudwatch_log_metric_filter" "levgorbunov1_cancel_workflow_filter" {
      + id             = (known after apply)
      + log_group_name = "/aws/lambda/GitHubIngestFunction"
      + name           = "VisibilityAccessControlChangeEvents"
      + pattern        = "{ ($.eventName = \"repository_visibility_change.disable\" || $.eventName = \"repository_visibility_change.enable\" || $.eventName = \"private_repository_forking.enable\") && ($.userIdentity.details.Repository = \"ministryofjustice/modernisation-platform-terraform-ec2-instance\") }"

      + metric_transformation {
          + name      = "VisibilityAccessControlChangeEvents"
          + namespace = "GitHubMetrics"
          + unit      = "None"
          + value     = "1"
        }
    }

  # module.unauthorized_users_modify_repository_settings_visibility.aws_cloudwatch_metric_alarm.levgorbunov1_cancel_workflow_alarm will be created
  + resource "aws_cloudwatch_metric_alarm" "levgorbunov1_cancel_workflow_alarm" {
      + actions_enabled                       = true
      + alarm_actions                         = [
          + "arn:aws:sns:eu-west-2:880656497252:modernisation-platform-github-alerts",
        ]
      + alarm_description                     = "Alarm for visibility and access control changes in the repository"
      + alarm_name                            = "VisibilityAccessControlChangeEventsAlarm"
      + arn                                   = (known after apply)
      + comparison_operator                   = "GreaterThanThreshold"
      + evaluate_low_sample_count_percentiles = (known after apply)
      + evaluation_periods                    = 1
      + id                                    = (known after apply)
      + metric_name                           = "VisibilityAccessControlChangeEvents"
      + namespace                             = "GitHubMetrics"
      + period                                = 60
      + statistic                             = "Sum"
      + tags_all                              = (known after apply)
      + threshold                             = 0
      + treat_missing_data                    = "missing"
    }

Plan: 12 to add, 0 to change, 2 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```